Revit 2024 API
FabricationItemFile.GetImage Method
Gets the image for the fabrication item file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public virtual Bitmap GetImage()
Visual Basic
Public Overridable Function GetImage As Bitmap
Visual C++
public:
virtual Bitmap^ GetImage()
Return Value
System.Drawing.Bitmap represents the fabrication item file image. null if there is no preview image.
See Also
FabricationItemFile Class
Autodesk.Revit.DB Namespace